[
  {
    "title": "B2B-Hub இந்தியா",
    "year": "ஆகஸ்ட் 2024",
    "shortDescription": "இந்தியாவின் பருப்பு தொழில்களை இணைப்பது",
    "description": "React Native பயன்படுத்தி B2B HUB INDIA மொபைல் செயலியை உருவாக்குவதில் முக்கிய பங்கு வகித்தேன். AsyncStorage இல் மொழித் தேர்வுடன் வரவேற்பு, முதல் பார்வை, பதிவு, முகப்பு, மற்றும் பயனர் சுயவிவரத்துடன் முக்கிய திரைகளை உருவாக்கினேன். நான்கு மொழிகளில் பல மொழி ஆதரவை i18Next மற்றும் useContext மூலம் நடைமுறைப்படுத்தினேன், இது இந்தியாவின் நகரங்கள் மற்றும் பகுதிகளுக்கு கிடைக்கும் பயன்பாட்டை 70% அதிகரிக்கச் செய்தது. அதனுடன் தயாரிப்பு விவரங்கள், ஆர்டர் சுருக்கம் மற்றும் விலைப்பட்டியல் உருவாக்கம், விற்பனையாளர்களுக்கான எளிய தரவுகள் வழிசெயல் போன்ற முக்கிய அம்சங்களையும் உருவாக்கினேன்.",
    "technologies": ["React-Native", "MySql", "Node js"],
    "category": "மொபைல்-செயலி",
    "githubLink": null,
    "socialLink": "https://www.b2bhubindia.com/",
    "demoLink": null
  },
  {
    "title": "Travello",
    "year": "செப்டம்பர் 2024",
    "shortDescription": "உங்கள் பணிக்கான பயண செயலி",
    "description": "Travello ஒரு மொபைல் செயலி ஆகும், இது ஊழியர்களின் வீடு மற்றும் அலுவலக இடையே போக்குவரத்தை மேம்படுத்த வடிவமைக்கப்பட்டுள்ளது. React Native, Redux, Node.js மற்றும் MySQL பயன்படுத்தி உருவாக்கப்பட்டது. இது பயனர் மற்றும் டிரைவர்களின் உண்மையான நேர அட்டவணைகளைக் காட்டுகிறது, அதன்படி வாகனத் தேர்வுகளையும், வருகை நேரத்தையும் சரிபார்க்கிறது.",
    "technologies": ["React-Native", "Redux", "Node js", "MySql"],
    "category": "மொபைல்-செயலி",
    "githubLink": null,
    "socialLink": null,
    "demoLink": null
  },
  {
    "title": "AI Helps",
    "year": "மார்ச் 2024",
    "shortDescription": "AI அடிப்படையிலான பட விளக்கங்கள் மூலம் வாடிக்கையாளர் கேள்விகளுக்கு பதிலளிக்கிறது",
    "description": "AI Helps என்பது 24/7 வாடிக்கையாளர் கேள்விகளை சரிசெய்ய ஒரு மேம்பட்ட AI சார்ந்த சேட்பாட் ஆகும், இது spring-open-ai பயன்படுத்தி உருவாக்கப்பட்டுள்ளது. Java, Spring Boot மற்றும் Spring AI மூலம் உருவாக்கப்பட்டு, AWS இல் மேம்படுத்தப்பட்ட அளவீட்டு திறன் மற்றும் PostgreSQL மூலம் தரவுகளை நிர்வகிக்கிறது. இதன் உதவியுடன் வாடிக்கையாளர்களுக்கு விரைவான மற்றும் சரியான பதில்களை வழங்குகிறது.",
    "technologies": ["Java", "SpringBoot", "SpringAI", "AWS", "Postgresql"],
    "category": "வலை-சேட்பாட்",
    "githubLink": "https://github.com/karthickpalanivel/SpringAI",
    "socialLink": null,
    "demoLink": null
  },
  {
    "title": "Rhino-Rewards",
    "year": "செப்டம்பர் 2023",
    "shortDescription": "ஆன்லைன் ஷாப்பிங் மூலம் SOL பரிசாக கிடைக்கும்",
    "description": "இந்த திட்டம் Solana (SOL) ஐ நுகர்வோர் பயன்பாடுகளுடன் இணைக்கிறது, Web 2.0 மற்றும் Web 3.0 இடையேயான பாலத்தை உருவாக்குகிறது, மையிகரிக்கப்பட்ட கட்டுப்பாடு மற்றும் தரவுப் பகிர்வு பிரச்சினைகளைத் தீர்க்கிறது. Solana இன் மிகுந்த திறன் மற்றும் குறைந்த பரிமாற்ற செலவினத்தைப் பயன்படுத்தி, Web2 அடிப்படையிலான கட்டமைப்புகளுக்குள் பல பயனுள்ளதாகும் மையமற்ற பயன்பாடுகளை உருவாக்கும் திறன் கொண்டது. கூடுதலாக, SOL டோக்கன் ஊக்கத்தை அறிமுகப்படுத்துவது பயனர் ஈடுபாட்டை ஊக்குவிக்கிறது மற்றும் மையமற்ற பங்கேற்பை ஊக்குவிக்கிறது, பயனர் மையமான Web 3.0 அனுபவத்திற்கு வழிவகுக்கிறது.",
    "technologies": ["React-Native", "Solana Blockchain"],
    "category": "Web-3 மொபைல் செயலி",
    "githubLink": null,
    "socialLink": "https://devfolio.co/projects/rhino-rewards-59ca",
    "demoLink": "https://www.youtube.com/watch?v=GIO8qZQ2QA4&t=3s"
  },

  {
    "title": "நூலக அமைப்புகள்",
    "year": "ஏப்ரல் 2023",
    "shortDescription": "உங்கள் நூலக பதிவுகளை டிஜிட்டலாக நிர்வகிக்கவும்",
    "description": "நூலக அமைப்புகள் என்பது நூலக மேலாண்மையை டிஜிட்டல் செய்ய வடிவமைக்கப்பட்ட டெஸ்க்டாப் செயலியாகும். Python GUI மற்றும் MySQL பயன்படுத்தி உருவாக்கப்பட்டது, இது புத்தக பதிவுகள், உறுப்பினர் தகவல்கள் மற்றும் கடன் செயல்பாடுகளை எளிதாக்குகிறது. நூலகர்களுக்கு பைபிளியோ விளக்கம், பைரிங் புத்தகங்களைக் கண்காணிக்கவும், மறுஅஞ்சல் இறுதிக் காலங்களைக் கண்காணிக்கவும் நேர்முகத்தில் உதவுகிறது. இத்துடன், பாதுகாக்கப்பட்ட தரவுத்தொகுப்பு ஒருங்கிணைப்புடன் மென்பொருள் தரவுகளை துல்லியமாகச் செய்கிறது, உடனடி அணுகலை வழங்குகிறது.",
    "technologies": ["Python GUI", "MySql", "Python"],
    "category": "டெஸ்க்டாப் செயலி",
    "githubLink": "https://github.com/karthickpalanivel/E-Book-Management-System.git",
    "socialLink": null,
    "demoLink": null
  }
]
